"App Management" = "Controllo App";

"WIFI Share" = "Trasferimenti WIFI";

"BT Download Only in Wi-Fi" = "Scarica BT solo col WIFI";

"BT Bandwidth & Connection" = "Connessione BT";

"Maximum Connections" = "Connessione massima";

"Connections Per Torrent" = "Connessione secondo Torrent";

"Enable Limit" = "Attiva Limite";

"Upload Limit" = "Aggiorna Limite";

"Download Limit" = "Limite Download";


"Automatically Install" = "Installa automaticamente";

"Delete After Install" = "Cancella dopo l'installamento";

"Remove Metadata"="Rimuovi Metadata";

"Keep Awake"="Tieni Sveglio";

"This will keep your screen always ON while using AppCake"="Questo terrà lo schermo acceso quando state usando AppCake";

"Remove Metadata will stop App Store from updating the app"="Rimuovendo la MetaData stopperai l'aggiornamento delle app sullo Store";

"Enable iTunes Sync to make apps installed by AppCake can be transfered to your computer by iTunes."="Attiva iTunes Sync per far si che le app di AppCake possano trasferirsi sul pc tramite iTunes.";

"iTunes Sync"="iTunes Sync";

"Feedback"="Feedback";

"Changelog"="Novità";

"I Can Translate"="Io posso tradurre";

"Clear Image Cache"="Cancella le immagini cache";

"Settings" = "Impostazioni";

"Show iPhone Apps" = "Mostra le app del iphone";